import pandas as pd


def get_sheet_all_values(sheet):
    # Google Sheetsからデータを取得し、処理したpandas DataFrameを返す関数
    data = pd.DataFrame(sheet.get_all_values())
    data.columns = list(data.iloc[0])
    data = data.drop(0, axis=0)
    data = data.reset_index(drop=True)
    return data


def symbols_escape(text):
    # 特殊記号をすべてエスケープする関数
    escaped_text = ""
    for char in text:
        if char in ["*", "_", "`", "~", "|", ">"]:
            escaped_text += "\\"
        escaped_text += char
    return escaped_text


admins_mention = []

result_ws = ""
room_ws = ""
member_ws = ""
club_ws = ""
input_member_ws = ""
input_club_ws = ""

room_data = ""
member_data = ""
club_data = ""

remind_role = ""

remind_ch = ""
result_ch = ""
repeat_result_ch = ""
register_ch = ""

build_message = (
    "★部屋建て\n"
    "以下のレギュレーションで部屋建てをお願いします。\n"
    "【レース】￤阪神芝2400m\n"
    "【人数】￤9人\n"
    "【時間】￤24時間後\n"
    "【季節/天気・バ場状態】￤冬／雨･重\n"
    "【やる気設定】￤絶好調\n"
    "\n"
    "部屋建て後、本テキストチャンネルにてレースID及び役職を添え、参加対象者をメンションの上でテキストを入力・送信してください。\n"
    "【例】\n"
    "@対戦相手1 @対戦相手2\n"
    "先鋒戦\n"
    "ルームID: 12345678\n"
    "参加対象者に対象レースへご参加いただき、揃い次第出走可とします。\n"
    "\n"
    "★結果報告\n"
    "レース結果を確認後、《レースに勝利した方》は本テキストチャンネルにてbotを用いて結果入力をしていただくようにお願いします。\n"
    "botで入力した内容は結果入力チャンネルでのみ公開され、本テキストチャンネルの表示は周りの方には見えません。\n"
    "また、レース参加者は念のためにスクリーンショット等により結果を保存してください。"
)

match_groups = [
    "予選y",
    "勝者qf1",
    "勝者qf2",
    "勝者qf3",
    "勝者qf4",
    "勝者qf5",
    "勝者sf1",
    "敗者y11",
    "敗者y12",
    "敗者y13",
    "敗者y14",
    "敗者y15",
    "敗者qf6",
    "敗者qf7",
    "敗者qf8",
    "敗者qf9",
    "敗者qf10",
    "敗者sf2",
    "敗者sf3",
    "決勝fin",
]

y_group = [
    "y1-1",
    "y2-1",
    "y3-1",
    "y4-1",
    "y5-1",
    "y6-1",
    "y7-1",
    "y8-1",
    "y9-1",
    "y10-1",
]
qf1_group = ["qf1-1"]  # , "qf1-2", "qf1-3", "qf1-4"]
qf2_group = ["qf2-1"]  # , "qf2-2", "qf2-3", "qf2-4"]
qf3_group = ["qf3-1"]  # , "qf3-2", "qf3-3", "qf3-4"]
qf4_group = ["qf4-1"]  # , "qf4-2", "qf4-3", "qf4-4"]
qf5_group = ["qf5-1"]  # , "qf5-2", "qf5-3", "qf5-4"]

y11_group = ["y11-1", "y11-2", "y11-3", "y11-4"]
y12_group = ["y12-1", "y12-2", "y12-3", "y12-4"]
y13_group = ["y13-1", "y13-2", "y13-3", "y13-4"]
y14_group = ["y14-1", "y14-2", "y14-3", "y14-4"]
y15_group = ["y15-1", "y15-2", "y15-3", "y15-4"]
qf6_group = ["qf6-1"]  # , "qf6-2", "qf6-3", "qf6-4"]
qf7_group = ["qf7-1"]  # , "qf7-2", "qf7-3", "qf7-4"]
qf8_group = ["qf8-1"]  # , "qf8-2", "qf8-3", "qf8-4"]
qf9_group = ["qf9-1"]  # , "qf9-2", "qf9-3", "qf9-4"]
qf10_group = ["qf10-1"]  # , "qf10-2", "qf10-3", "qf10-4"]

sf1_group = [
    "sf1-1",
    "sf1-2",
    "sf1-3",
    "sf1-4",
    "sf1-5",
    "sf1-6",
    "sf1-7",
    "sf1-8",
    "sf1-9",
    "sf1-10",
]
sf2_group = ["sf2-1", "sf2-2", "sf2-3", "sf2-4"]
sf3_group = ["sf3-1", "sf3-2", "sf3-3", "sf3-4"]

fin_group = ["fin-1", "fin-2", "fin-3", "fin-4"]

match_group_mapping = {
    "予選y": y_group,
    "勝者qf1": qf1_group,
    "勝者qf2": qf2_group,
    "勝者qf3": qf3_group,
    "勝者qf4": qf4_group,
    "勝者qf5": qf5_group,
    "勝者sf1": sf1_group,
    "敗者y11": y11_group,
    "敗者y12": y12_group,
    "敗者y13": y13_group,
    "敗者y14": y14_group,
    "敗者y15": y15_group,
    "敗者qf6": qf6_group,
    "敗者qf7": qf7_group,
    "敗者qf8": qf8_group,
    "敗者qf9": qf9_group,
    "敗者qf10": qf10_group,
    "敗者sf2": sf2_group,
    "敗者sf3": sf3_group,
    "決勝fin": fin_group,
}

uma_list_mapping = {
    "001": "アイネスフウジン",
    "002": "アイネスフウジン(バレンタイン)",
    "003": "アグネスタキオン",
    "004": "アグネスタキオン(水着)",
    "005": "アグネスタキオン(眼鏡)",
    "006": "アグネスデジタル",
    "007": "アグネスデジタル(ハロウィン)",
    "008": "アストンマーチャン",
    "009": "アドマイヤベガ",
    "010": "アドマイヤベガ(クリスマス)",
    "011": "イクノディクタス",
    "012": "イナリワン",
    "013": "イナリワン(秋)",
    "014": "ウイニングチケット",
    "015": "ウイニングチケット(モノクル)",
    "016": "ウイニングチケット(UAF)",
    "017": "ヴィブロス",
    "018": "ウインバリアシオン",
    "019": "ウオッカ",
    "020": "ウオッカ(クリスマス)",
    "021": "エアグルーヴ",
    "022": "エアグルーヴ(花嫁)",
    "023": "エアシャカール",
    "024": "エアシャカール(ハロウィン)",
    "025": "エアメサイア",
    "026": "エイシンフラッシュ",
    "027": "エイシンフラッシュ(バレンタイン)",
    "028": "エイシンフラッシュ(水着)",
    "029": "エルコンドルパサー",
    "030": "エルコンドルパサー(ウマネスト)",
    "031": "オグリキャップ",
    "032": "オグリキャップ(クリスマス)",
    "033": "カツラギエース",
    "034": "カツラギエース(正月)",
    "035": "カルストンライトオ",
    "036": "カレンチャン",
    "037": "カレンチャン(花嫁)",
    "038": "カワカミプリンセス",
    "039": "カワカミプリンセス(秋)",
    "040": "キタサンブラック",
    "041": "キタサンブラック(正月)",
    "042": "キタサンブラック(アニメ)",
    "043": "キングヘイロー",
    "044": "キングヘイロー(応援団)",
    "045": "キングヘイロー(花嫁)",
    "046": "グラスワンダー",
    "047": "グラスワンダー(ウマネスト)",
    "048": "グラスワンダー(蒼炎)",
    "049": "ケイエスミラクル",
    "050": "ゴールドシチー",
    "051": "ゴールドシチー(秋)",
    "052": "ゴールドシップ",
    "053": "ゴールドシップ(水着)",
    "054": "ゴールドシップ(ロンシャン)",
    "055": "コパノリッキー",
    "056": "サイレンススズカ",
    "057": "サイレンススズカ(水着)",
    "058": "サウンズオブアース",
    "059": "サクラチヨノオー",
    "060": "サクラチヨノオー(ドレス)",
    "061": "サクラバクシンオー",
    "062": "サクラバクシンオー(運動会)",
    "063": "サクラローレル",
    "064": "サトノクラウン",
    "065": "サトノダイヤモンド",
    "066": "サトノダイヤモンド(正月)",
    "067": "サトノダイヤモンド(ロンシャン)",
    "068": "シーキングザパール",
    "069": "シーキングザパール(ハロウィン)",
    "070": "シーザリオ",
    "071": "ジェンティルドンナ",
    "072": "ジャングルポケット",
    "073": "シュヴァルグラン",
    "074": "シリウスシンボリ",
    "075": "シンコウウインディ",
    "076": "シンボリクリスエス",
    "077": "シンボリクリスエス(ハロウィン)",
    "078": "シンボリルドルフ",
    "079": "シンボリルドルフ(秋)",
    "080": "スイープトウショウ",
    "081": "スイープトウショウ(花嫁)",
    "082": "スーパークリーク",
    "083": "スーパークリーク(ハロウィン)",
    "084": "スーパークリーク(忍者)",
    "085": "スペシャルウィーク",
    "086": "スペシャルウィーク(水着)",
    "087": "スペシャルウィーク(総大将)",
    "088": "スマートファルコン",
    "089": "スマートファルコン(黄色)",
    "090": "セイウンスカイ",
    "091": "セイウンスカイ(ダンス)",
    "092": "ゼンノロブロイ",
    "093": "ゼンノロブロイ(秋)",
    "094": "ダイイチルビー",
    "095": "ダイイチルビー(ダンス)",
    "096": "タイキシャトル",
    "097": "タイキシャトル(夏)",
    "098": "ダイタクヘリオス",
    "099": "ダイタクヘリオス(ダンス)",
    "100": "ダイワスカーレット",
    "101": "ダイワスカーレット(クリスマス)",
    "102": "タップダンスシチー",
    "103": "タニノギムレット",
    "104": "タマモクロス",
    "105": "タマモクロス(秋)",
    "106": "ツインターボ",
    "107": "テイエムオペラオー",
    "108": "テイエムオペラオー(正月)",
    "109": "デュランダル",
    "110": "トウカイテイオー",
    "111": "トウカイテイオー(アニメ)",
    "112": "トウカイテイオー(秋)",
    "113": "ドゥラメンテ",
    "114": "トーセンジョーダン",
    "115": "トーセンジョーダン(夏)",
    "116": "トランセンド",
    "117": "ドリームジャーニー",
    "118": "ナイスネイチャ",
    "119": "ナイスネイチャ(チア)",
    "120": "ナイスネイチャ(正月)",
    "121": "ナカヤマフェスタ",
    "122": "ナリタタイシン",
    "123": "ナリタタイシン(モノクル)",
    "124": "ナリタタイシン(メカ)",
    "125": "ナリタトップロード",
    "126": "ナリタトップロード(クリスマス)",
    "127": "ナリタブライアン",
    "128": "ナリタブライアン(餓狼)",
    "129": "ニシノフラワー",
    "130": "ニシノフラワー(花嫁)",
    "131": "ネオユニヴァース",
    "132": "ネオユニヴァース(メガネ)",
    "133": "ノースフライト",
    "134": "バブルガムフェロー",
    "135": "ハルウララ",
    "136": "ハルウララ(正月)",
    "137": "バンブーメモリー",
    "138": "バンブーメモリー(夏)",
    "139": "ビコーペガサス",
    "140": "ヒシアケボノ",
    "141": "ヒシアマゾン",
    "142": "ヒシアマゾン(花嫁)",
    "143": "ヒシミラクル",
    "144": "ビワハヤヒデ",
    "145": "ビワハヤヒデ(クリスマス)",
    "146": "ビワハヤヒデ(メカ)",
    "147": "ファインモーション",
    "148": "ファインモーション(花嫁)",
    "149": "フジキセキ",
    "150": "フジキセキ(ダンス)",
    "151": "ホッコータルマエ",
    "152": "ホッコータルマエ(水着)",
    "153": "マーベラスサンデー",
    "154": "マチカネタンホイザ",
    "155": "マチカネタンホイザ(運動会)",
    "156": "マチカネフクキタル",
    "157": "マチカネフクキタル(アオハル)",
    "158": "マヤノトップガン",
    "159": "マヤノトップガン(花嫁)",
    "160": "マヤノトップガン(ハロウィン)",
    "161": "マルゼンスキー",
    "162": "マルゼンスキー(水着)",
    "163": "マルゼンスキー(天女)",
    "164": "マンハッタンカフェ",
    "165": "マンハッタンカフェ(バレンタイン)",
    "166": "ミスターシービー",
    "167": "ミスターシービー(正月)",
    "168": "ミホノブルボン",
    "169": "ミホノブルボン(バレンタイン)",
    "170": "メイショウドトウ",
    "171": "メイショウドトウ(ハロウィン)",
    "172": "メジロアルダン",
    "173": "メジロアルダン(ダンス)",
    "174": "メジロドーベル",
    "175": "メジロドーベル(夏)",
    "176": "メジロパーマー",
    "177": "メジロパーマー(クリスマス)",
    "178": "メジロブライト",
    "179": "メジロブライト(クリスマス)",
    "180": "メジロマックイーン",
    "181": "メジロマックイーン(アニメ)",
    "182": "メジロマックイーン(水着)",
    "183": "メジロライアン",
    "184": "メジロライアン(バレンタイン)",
    "185": "メジロラモーヌ",
    "186": "ヤエノムテキ",
    "187": "ヤエノムテキ(侍)",
    "188": "ヤマニンゼファー",
    "189": "ユキノビジン",
    "190": "ユキノビジン(バレンタイン)",
    "191": "ライスシャワー",
    "192": "ライスシャワー(ハロウィン)",
    "193": "ライスシャワー(エプロン)",
    "194": "ラインクラフト",
    "195": "ワンダーアキュート",
}
