import pandas as pd

def get_sheet_all_values(sheet):
    # Google Sheetsからデータを取得し、処理したpandas DataFrameを返す関数
    data = pd.DataFrame(sheet.get_all_values())
    data.columns = list(data.iloc[0])
    data = data.drop(0, axis=0)
    data = data.reset_index(drop=True)
    return data

def symbols_escape(text):
    # 特殊記号をすべてエスケープする関数
    escaped_text = ""
    for char in text:
            if char in ['*', '_', '`', '~', '|', '>']:
                escaped_text += '\\'
            escaped_text += char
    return escaped_text

admins_mention = []

result_ws = ""
room_ws = ""
member_ws = ""
club_ws = ""
input_member_ws = ""
input_club_ws = ""

room_data = ""
member_data = ""
club_data= ""

remind_role = ""

remind_ch = ""
result_ch = ""
register_ch = ""

build_message = (
    "★部屋建て\n"
	"以下のレギュレーションで部屋建てをお願いします。\n"
	"【レース】￤天皇賞・秋\n"
	"【人数】￤9人\n"
	"【時間】￤24時間後\n"
	"【季節/天気・バ場状態】￤秋／良･晴\n"
	"【やる気設定】￤絶好調\n"
	"\n"
	"部屋建て後、本テキストチャンネルにてレースID及び役職を添え、参加対象者をメンションの上でテキストを入力・送信してください。\n"
	"【例】\n"
	"@対戦相手1 @対戦相手2\n"
	"先鋒戦\n"
	"ルームID: 12345678\n"
	"参加対象者に対象レースへご参加いただき、揃い次第出走可とします。\n"
	"\n"
	"★結果報告\n"
	"レース結果を確認後、《レースに勝利した方》は本テキストチャンネルにてbotを用いて結果入力をしていただくようにお願いします。\n"
	"botで入力した内容は結果入力チャンネルでのみ公開され、本テキストチャンネルの表示は周りの方には見えません。\n"
	"また、レース参加者は念のためにスクリーンショット等により結果を保存してください。"
)

match_groups = ["予選y", "勝者qf1", "勝者qf2", "勝者qf3", "勝者qf4", "勝者sf1", 
          "敗者y11", "敗者y12", "敗者y13", "敗者y14", "敗者y15",
          "敗者qf5", "敗者qf6", "敗者qf7", "敗者qf8", "敗者sf2", "敗者sf3", "決勝fin"]

y_group = ["y1-1", "y2-1", "y3-1", "y4-1", "y5-1", "y6-1", "y7-1", "y8-1", "y9-1", "y10-1"]
qf1_group = ["qf1-1"]#, "qf1-2", "qf1-3", "qf1-4"]
qf2_group = ["qf2-1"]#, "qf2-2", "qf2-3", "qf2-4"]
qf3_group = ["qf3-1"]#, "qf3-2", "qf3-3", "qf3-4"]
qf4_group = ["qf4-1"]#, "qf4-2", "qf4-3", "qf4-4"]

y11_group = ["y11-1", "y11-2", "y11-3", "y11-4"]
y12_group = ["y12-1", "y12-2", "y12-3", "y12-4"]
y13_group = ["y13-1", "y13-2", "y13-3", "y13-4"]
y14_group = ["y14-1", "y14-2", "y14-3", "y14-4"]
y15_group = ["y15-1", "y15-2", "y15-3", "y15-4"]
qf5_group = ["qf5-1", "qf5-2", "qf5-3", "qf5-4"]
qf6_group = ["qf6-1"]#, "qf6-2", "qf6-3", "qf6-4"]
qf7_group = ["qf7-1"]#, "qf7-2", "qf7-3", "qf7-4"]
qf8_group = ["qf8-1"]#, "qf8-2", "qf8-3", "qf8-4"]

sf1_group = ["sf1-1", "sf1-2", "sf1-3", "sf1-4"]
sf2_group = ["sf2-1"]#, "sf2-2", "sf2-3", "sf2-4"]
sf3_group = ["sf3-1"]#, "sf3-2", "sf3-3", "sf3-4"]

fin_group = ["fin-1", "fin-2", "fin-3", "fin-4"]

match_group_mapping = {
    "予選y": y_group,
    "勝者qf1": qf1_group,
    "勝者qf2": qf2_group,
    "勝者qf3": qf3_group,
    "勝者qf4": qf4_group,
    "勝者sf1": sf1_group,
    "敗者y11": y11_group,
    "敗者y12": y12_group,
    "敗者y13": y13_group,
    "敗者y14": y14_group,
    "敗者y15": y15_group,
    "敗者qf5": qf5_group,
    "敗者qf6": qf6_group,
    "敗者qf7": qf7_group,
    "敗者qf8": qf8_group,
    "敗者sf2": sf2_group,
    "敗者sf3": sf3_group,
    "決勝fin": fin_group,
}

uma_list_mapping = {
	"001": "アイネスフウジン",
	"002": "アイネスフウジン(バレンタイン)",
	"003": "アグネスタキオン",
	"004": "アグネスタキオン(水着)",
	"005": "アグネスタキオン(眼鏡)",
	"006": "アグネスデジタル",
	"007": "アグネスデジタル(ハロウィン)",
	"008": "アストンマーチャン",
	"009": "アドマイヤベガ",
	"010": "イクノディクタス",
	"011": "イナリワン",
	"012": "イナリワン(秋)",
	"013": "ウイニングチケット",
	"014": "ウイニングチケット(機械)",
	"015": "ウイニングチケット(UAF)",
	"016": "ヴィブロス",
	"017": "ウオッカ",
	"018": "ウオッカ(クリスマス)",
	"019": "エアグルーヴ",
	"020": "エアグルーヴ(花嫁)",
	"021": "エアシャカール",
	"022": "エアシャカール(ハロウィン)",
	"023": "エイシンフラッシュ",
	"024": "エイシンフラッシュ(バレンタイン)",
	"025": "エイシンフラッシュ(水着)",
	"026": "エルコンドルパサー",
	"027": "エルコンドルパサー(ウマネスト)",
	"028": "オグリキャップ",
	"029": "オグリキャップ(クリスマス)",
	"030": "カツラギエース",
	"031": "カルストンライトオ",
	"032": "カレンチャン",
	"033": "カレンチャン(花嫁)",
	"034": "カワカミプリンセス",
	"035": "カワカミプリンセス(秋)",
	"036": "キタサンブラック",
	"037": "キタサンブラック(正月)",
	"038": "キタサンブラック(アニメ)",
	"039": "キングヘイロー",
	"040": "キングヘイロー(応援団)",
	"041": "キングヘイロー(花嫁)",
	"042": "グラスワンダー",
	"043": "グラスワンダー(ウマネスト)",
	"044": "ケイエスミラクル",
	"045": "ゴールドシチー",
	"046": "ゴールドシチー(秋)",
	"047": "ゴールドシップ",
	"048": "ゴールドシップ(水着)",
	"049": "ゴールドシップ(ロンシャン)",
	"050": "コパノリッキー",
	"051": "サイレンススズカ",
	"052": "サイレンススズカ(水着)",
	"053": "サウンズオブアース",
	"054": "サクラチヨノオー",
	"055": "サクラチヨノオー(ドレス)",
	"056": "サクラバクシンオー",
	"057": "サクラバクシンオー(運動会)",
	"058": "サクラローレル",
	"059": "サトノクラウン",
	"060": "サトノダイヤモンド",
	"061": "サトノダイヤモンド(正月)",
	"062": "サトノダイヤモンド(ロンシャン)",
	"063": "シーキングザパール",
	"064": "シーキングザパール(ハロウィン)",
	"065": "シーザリオ",
	"066": "ジェンティルドンナ",
	"067": "ジャングルポケット",
	"068": "シュヴァルグラン",
	"069": "シリウスシンボリ",
	"070": "シンコウウインディ",
	"071": "シンボリクリスエス",
	"072": "シンボリクリスエス(ハロウィン)",
	"073": "シンボリルドルフ",
	"074": "シンボリルドルフ(秋)",
	"075": "スイープトウショウ",
	"076": "スイープトウショウ(花嫁)",
	"077": "スーパークリーク",
	"078": "スーパークリーク(ハロウィン)",
	"079": "スーパークリーク(忍者)",
	"080": "スペシャルウィーク",
	"081": "スペシャルウィーク(水着)",
	"082": "スペシャルウィーク(総大将)",
	"083": "スマートファルコン",
	"084": "スマートファルコン(黄色)",
	"085": "セイウンスカイ",
	"086": "セイウンスカイ(ダンス)",
	"087": "ゼンノロブロイ",
	"088": "ゼンノロブロイ(秋)",
	"089": "ダイイチルビー",
	"090": "ダイイチルビー(ダンス)",
	"091": "タイキシャトル",
	"092": "タイキシャトル(夏)",
	"093": "ダイタクヘリオス",
	"094": "ダイタクヘリオス(ダンス)",
	"095": "ダイワスカーレット",
	"096": "ダイワスカーレット(クリスマス)",
	"097": "タップダンスシチー",
	"098": "タニノギムレット",
	"099": "タマモクロス",
	"100": "タマモクロス(秋)",
	"101": "ツインターボ",
	"102": "テイエムオペラオー",
	"103": "テイエムオペラオー(正月)",
	"104": "デュランダル",
	"105": "トウカイテイオー",
	"106": "トウカイテイオー(アニメ)",
	"107": "トウカイテイオー(秋)",
	"108": "ドゥラメンテ",
	"109": "トーセンジョーダン",
	"110": "トーセンジョーダン(夏)",
	"111": "トランセンド",
	"112": "ドリームジャーニー",
	"113": "ナイスネイチャ",
	"114": "ナイスネイチャ(チア)",
	"115": "ナイスネイチャ(正月)",
	"116": "ナカヤマフェスタ",
	"117": "ナリタタイシン",
	"118": "ナリタタイシン(機械)",
	"119": "ナリタトップロード",
	"120": "ナリタブライアン",
	"121": "ナリタブライアン(餓狼)",
	"122": "ニシノフラワー",
	"123": "ニシノフラワー(花嫁)",
	"124": "ネオユニヴァース",
	"125": "ネオユニヴァース(メガネ)",
	"126": "ノースフライト",
	"127": "バブルガムフェロー",
	"128": "ハルウララ",
	"129": "ハルウララ(正月)",
	"130": "バンブーメモリー",
	"131": "バンブーメモリー(夏)",
	"132": "ビコーペガサス",
	"133": "ヒシアケボノ",
	"134": "ヒシアマゾン",
	"135": "ヒシアマゾン(花嫁)",
	"136": "ヒシミラクル",
	"137": "ビワハヤヒデ",
	"138": "ビワハヤヒデ(クリスマス)",
	"139": "ファインモーション",
	"140": "ファインモーション(花嫁)",
	"141": "フジキセキ",
	"142": "フジキセキ(ダンス)",
	"143": "ホッコータルマエ",
	"144": "ホッコータルマエ(水着)",
	"145": "マーベラスサンデー",
	"146": "マチカネタンホイザ",
	"147": "マチカネタンホイザ(運動会)",
	"148": "マチカネフクキタル",
	"149": "マチカネフクキタル(アオハル)",
	"150": "マヤノトップガン",
	"151": "マヤノトップガン(花嫁)",
	"152": "マヤノトップガン(ハロウィン)",
	"153": "マルゼンスキー",
	"154": "マルゼンスキー(水着)",
	"155": "マンハッタンカフェ",
	"156": "マンハッタンカフェ(バレンタイン)",
	"157": "ミスターシービー",
	"158": "ミホノブルボン",
	"159": "ミホノブルボン(バレンタイン)",
	"160": "メイショウドトウ",
	"161": "メイショウドトウ(ハロウィン)",
	"162": "メジロアルダン",
	"163": "メジロアルダン(ダンス)",
	"164": "メジロドーベル",
	"165": "メジロドーベル(夏)",
	"166": "メジロパーマー",
	"167": "メジロパーマー(クリスマス)",
	"168": "メジロブライト",
	"169": "メジロブライト(クリスマス)",
	"170": "メジロマックイーン",
	"171": "メジロマックイーン(アニメ)",
	"172": "メジロマックイーン(水着)",
	"173": "メジロライアン",
	"174": "メジロライアン(バレンタイン)",
	"175": "メジロラモーヌ",
	"176": "ヤエノムテキ",
	"177": "ヤエノムテキ(侍)",
	"178": "ヤマニンゼファー",
	"179": "ユキノビジン",
	"180": "ユキノビジン(バレンタイン)",
	"181": "ライスシャワー",
	"182": "ライスシャワー(ハロウィン)",
	"183": "ライスシャワー(エプロン)",
	"184": "ラインクラフト",
	"185": "ワンダーアキュート",
}