from datetime import datetime
from typing import NamedTuple

# datetime(2024, 9, 10, 8, 0): ("event", "type"),  # 2024/9/10 8:00
# ["予選", "勝者側-準々決", "勝者側-準決", "敗者側-予選", "敗者側-準々決", "敗者側-準決"]
# [部屋建て期限、入室期限、結果提出期限],[3時間前,1時間前,30分前]


class Schedule(NamedTuple):
    datetime: datetime
    event: str
    type: str


schedule_data = [
    Schedule(datetime(2024, 10, 24, 16, 0), "予選部屋建て期限3時間前", "予選"),
    Schedule(datetime(2024, 10, 24, 17, 0), "予選入室期限3時間前", "予選"),
    Schedule(datetime(2024, 10, 24, 18, 0), "予選結果提出期限3時間前", "予選"),
    Schedule(datetime(2024, 10, 24, 18, 0), "予選部屋建て期限1時間前", "予選"),
    Schedule(datetime(2024, 10, 24, 19, 0), "予選入室期限1時間前", "予選"),
    Schedule(datetime(2024, 10, 24, 20, 0), "予選結果提出期限1時間前", "予選"),
    Schedule(datetime(2024, 10, 24, 18, 30), "予選部屋建て期限30分前", "予選"),
    Schedule(datetime(2024, 10, 24, 19, 30), "予選入室期限30分前", "予選"),
    Schedule(datetime(2024, 10, 24, 20, 30), "予選結果提出期限30分前", "予選"),
    Schedule(
        datetime(2024, 10, 25, 16, 0),
        "勝者側-準々決部屋建て期限3時間前",
        "勝者側-準々決",
    ),
    Schedule(
        datetime(2024, 10, 25, 17, 0), "勝者側-準々決入室期限3時間前", "勝者側-準々決"
    ),
    Schedule(
        datetime(2024, 10, 25, 18, 0),
        "勝者側-準々決結果提出期限3時間前",
        "勝者側-準々決",
    ),
    Schedule(
        datetime(2024, 10, 25, 18, 0),
        "勝者側-準々決部屋建て期限1時間前",
        "勝者側-準々決",
    ),
    Schedule(
        datetime(2024, 10, 25, 19, 0), "勝者側-準々決入室期限1時間前", "勝者側-準々決"
    ),
    Schedule(
        datetime(2024, 10, 25, 20, 0),
        "勝者側-準々決結果提出期限1時間前",
        "勝者側-準々決",
    ),
    Schedule(
        datetime(2024, 10, 25, 18, 30),
        "勝者側-準々決部屋建て期限30分前",
        "勝者側-準々決",
    ),
    Schedule(
        datetime(2024, 10, 25, 19, 30), "勝者側-準々決入室期限30分前", "勝者側-準々決"
    ),
    Schedule(
        datetime(2024, 10, 25, 20, 30),
        "勝者側-準々決結果提出期限30分前",
        "勝者側-準々決",
    ),
    Schedule(
        datetime(2024, 10, 26, 7, 0), "勝者側-準決部屋建て期限3時間前", "勝者側-準決"
    ),
    Schedule(datetime(2024, 10, 26, 8, 0), "勝者側-準決入室期限3時間前", "勝者側-準決"),
    Schedule(
        datetime(2024, 10, 26, 9, 0), "勝者側-準決結果提出期限3時間前", "勝者側-準決"
    ),
    Schedule(
        datetime(2024, 10, 26, 9, 0), "勝者側-準決部屋建て期限1時間前", "勝者側-準決"
    ),
    Schedule(
        datetime(2024, 10, 26, 10, 0), "勝者側-準決入室期限1時間前", "勝者側-準決"
    ),
    Schedule(
        datetime(2024, 10, 26, 11, 0), "勝者側-準決結果提出期限1時間前", "勝者側-準決"
    ),
    Schedule(
        datetime(2024, 10, 26, 9, 30), "勝者側-準決部屋建て期限30分前", "勝者側-準決"
    ),
    Schedule(
        datetime(2024, 10, 26, 10, 30), "勝者側-準決入室期限30分前", "勝者側-準決"
    ),
    Schedule(
        datetime(2024, 10, 26, 11, 30), "勝者側-準決結果提出期限30分前", "勝者側-準決"
    ),
    Schedule(
        datetime(2024, 10, 25, 16, 0), "敗者側-予選部屋建て期限3時間前", "敗者側-予選"
    ),
    Schedule(
        datetime(2024, 10, 25, 17, 0), "敗者側-予選入室期限3時間前", "敗者側-予選"
    ),
    Schedule(
        datetime(2024, 10, 25, 18, 0), "敗者側-予選結果提出期限3時間前", "敗者側-予選"
    ),
    Schedule(
        datetime(2024, 10, 25, 18, 0), "敗者側-予選部屋建て期限1時間前", "敗者側-予選"
    ),
    Schedule(
        datetime(2024, 10, 25, 19, 0), "敗者側-予選入室期限1時間前", "敗者側-予選"
    ),
    Schedule(
        datetime(2024, 10, 25, 20, 0), "敗者側-予選結果提出期限1時間前", "敗者側-予選"
    ),
    Schedule(
        datetime(2024, 10, 25, 18, 30), "敗者側-予選部屋建て期限30分前", "敗者側-予選"
    ),
    Schedule(
        datetime(2024, 10, 25, 19, 30), "敗者側-予選入室期限30分前", "敗者側-予選"
    ),
    Schedule(
        datetime(2024, 10, 25, 20, 30), "敗者側-予選結果提出期限30分前", "敗者側-予選"
    ),
    Schedule(
        datetime(2024, 10, 26, 7, 0),
        "敗者側-準々決部屋建て期限3時間前",
        "敗者側-準々決",
    ),
    Schedule(
        datetime(2024, 10, 26, 8, 0), "敗者側-準々決入室期限3時間前", "敗者側-準々決"
    ),
    Schedule(
        datetime(2024, 10, 26, 9, 0),
        "敗者側-準々決結果提出期限3時間前",
        "敗者側-準々決",
    ),
    Schedule(
        datetime(2024, 10, 26, 9, 0),
        "敗者側-準々決部屋建て期限1時間前",
        "敗者側-準々決",
    ),
    Schedule(
        datetime(2024, 10, 26, 10, 0), "敗者側-準々決入室期限1時間前", "敗者側-準々決"
    ),
    Schedule(
        datetime(2024, 10, 26, 11, 0),
        "敗者側-準々決結果提出期限1時間前",
        "敗者側-準々決",
    ),
    Schedule(
        datetime(2024, 10, 26, 9, 30),
        "敗者側-準々決部屋建て期限30分前",
        "敗者側-準々決",
    ),
    Schedule(
        datetime(2024, 10, 26, 10, 30), "敗者側-準々決入室期限30分前", "敗者側-準々決"
    ),
    Schedule(
        datetime(2024, 10, 26, 11, 30),
        "敗者側-準々決結果提出期限30分前",
        "敗者側-準々決",
    ),
    Schedule(
        datetime(2024, 10, 26, 17, 0), "敗者側-準決部屋建て期限3時間前", "敗者側-準決"
    ),
    Schedule(
        datetime(2024, 10, 26, 18, 0), "敗者側-準決入室期限3時間前", "敗者側-準決"
    ),
    Schedule(
        datetime(2024, 10, 26, 19, 0), "敗者側-準決結果提出期限3時間前", "敗者側-準決"
    ),
    Schedule(
        datetime(2024, 10, 26, 19, 0), "敗者側-準決部屋建て期限1時間前", "敗者側-準決"
    ),
    Schedule(
        datetime(2024, 10, 26, 20, 0), "敗者側-準決入室期限1時間前", "敗者側-準決"
    ),
    Schedule(
        datetime(2024, 10, 26, 21, 0), "敗者側-準決結果提出期限1時間前", "敗者側-準決"
    ),
    Schedule(
        datetime(2024, 10, 26, 19, 30), "敗者側-準決部屋建て期限30分前", "敗者側-準決"
    ),
    Schedule(
        datetime(2024, 10, 26, 20, 30), "敗者側-準決入室期限30分前", "敗者側-準決"
    ),
    Schedule(
        datetime(2024, 10, 26, 21, 30), "敗者側-準決結果提出期限30分前", "敗者側-準決"
    ),
]
